export const questions = [
  {
    id: 1,
    title: "چگونه رمز عبور خود را تغییر دهم؟",
    description:
      "از طریق رفتن به بخش حساب کاربری خود در قسمت تغییر رمزعبور شما میتوانید رمزعبور خودرا تغییر دهید",
  },
  {
    id: 2,
    title: "برای دیدن تور های موجود کجا باید برم؟",
    description:
      "پس از ورود به برنامه از منوی پایین گزینه تور ها را انتخاب کنید. حالا میتوانید تمام تورهای موجود را مشاهده کنید",
  },
  {
    id: 3,
    title: "چند روز قبل از پرواز، بلیط هواپیما را بخریم؟",
    description:
      "امکان رزرو بلیط هواپیما از ماه‌ها قبل وجود دارد. اما گاهی اوقات قیمت بلیط هواپیما در روزهای نزدیک به پرواز ارزان‌تر می‌شود. بنابراین در صورتی که شرایطتان اجازه می‌دهد، رزرو آنلاین بلیط هواپیما را به روزهای نزدیک پرواز موکول کنید. البته اگر قصد سفر در ایام پرسفر نظیر تعطیلات را دارید، باید هر چه زودتر رزرو بلیط هواپیما را انجام دهید.",
  },
  {
    id: 4,
    title: "در هر پرواز، میزان بار مجاز چقدر است؟",
    description:
      "میزان مجاز بار به کلاس پرواز و کلاس نرخی بلیط بستگی دارد. هنگام خرید آنلاین بلیط هواپیما می‌توانید میزان بار مجاز را در اطلاعات بلیط ببینید. طبیعی است که اگر میزان بارتان بیش از حد مجاز باشد، باید جریمه پرداخت کنید.",
  },
];
