import BackLayout from "@/src/layouts/backLayout";
import { Divider, Text, View } from "native-base";

export const Rules = () => {
  return (
    <BackLayout title="قوانین و مقررات">
      <View>
        <Text textAlign="right">قوانین و مقررات عمومی</Text>
        <Text textAlign="right">
          وب سایت فلای تودی بر طبق قوانین جمهوری اسلامی ایران، قوانین مرتبط با جرائم اینترنتی و
          مجموعه قوانین و مقررات تجارت الکترونیکی فعالیت دارد. محتوا و خدماتی که در این وب سایت
          تولیده شده تنها برای استفاده در سایت فلای تودی است. هر گونه سوءاستفاده افراد حقیقی و حقوقی
          از اطلاعات، متن‌ها، عکس‌ها، نقشه‌ها، طرح‌ها، لوگو و... این وب‌سایت پیگرد قانونی دارد.
          استفاده از مطالب وب سایت در اینترنت تنها با ذکر نام، نشانی اینترنتی و لینک دهی به سایت
          فلای تودی مجاز خواهد بود. همچنین انتشار مطالب در رسانه‌های کاغذی تنها با کسب اجازه کتبی از
          مسئولان سایت امکان‌پذیر است. کاربر باید هرگونه تغییر در مشخصات فردی خود را در سایت فلای
          تودی وارد کند. در صورت مغایرت اطلاعات شخصی افراد با مشخصات بلیط، واچر یا کارت شناسایی،
          مسافر پذیرش نخواهد شد. همچنین سایت فلای تودی مسئولیتی در مقابل پیامدهای ناشی از عدم صحت
          اطلاعات فردی مسافر نخواهد داشت. وب سایت فلای تودی در مقابل هرگونه تاخیر،‌ تعجیل یا کنسلی
          پرواز مسئولیتی نخواهد داشت. باتوجه به تغییرات لحظه‌ای قیمت از سمت تامین کننده پرواز و هتل،
          امکان تغییر قیمت از لحظه جستجو تا زمان ورود به درگاه بانکی وجود دارد. فلای تودی تلاش
          می‌کند که قیمت به بهترین شکل ممکن در کمترین زمان ممکن بروز شود، با این حال به دلیل تغییر
          شرایط ممکن است این قیمت تغییر کند و مسئولیت تطبیق و تایید قیمت نهایی با مبلغ پرداختی در
          درگاه بر عهده خریدار است.
        </Text>
        <Divider my={6} />
        <Text textAlign="right">شرایط ثبت‌نام و عضویت در سایت</Text>
        <Text textAlign="right">
          اربران می‌توانند به صورت رایگان در سایت فلای تودی ثبت‌نام کنند. کاربر باید اطلاعات خود را
          هنگام ثبت نام، صحیح وارد کند درغیر این صورت مسئولیت اطلاعات ناقص و نادرست برعهده‌ کاربر
          خواهد بود. مسافران باید هنگام ثبت نام و رزرو بلیط، اطلاعات اصلی مانند نام و نام خانوادگی،‌
          مسیر پرواز، ساعت پرواز، تاریخ سفر را صحیح وارد کنند. درغیر این صورت امکان اصلاح اطلاعات پس
          از خرید بلیط وجود نخواهد داشت و مسافر باید برای اصلاح اطلاعات، بلیط را کنسل و مجددا
          خریداری کند. اطلاعات شخصی کاربران در سایت فلای تودی کاملا محرمانه خواهد بود. حریم شخصی
          کاربران حفظ خواهد شد و کاربر باید از هرگونه مشارکت و معاونت در هک کردن هر نوع اطلاعاتی
          خودداری کند. تمامی سفارش‌های کاربران، خدمات و پشتیبانی از طریق نام کاربری و رمز عبور انجام
          می‌شود و مشتری مسئول حفظ اطلاعات کاربری خواهد بود. مسئولیت حفظ و نگهداری کلیه مدارک اعم از
          پاسپورت ،کارت شناسایی ، اشیا زینتی و گرانبها، موبایل، کیف پول، چمدان و لوازم دیگر مسافرها،
          بر عهده ی شخص مسافر بوده و در صورت مفقودی و اتفاقات مشابه در هتل ها و اماکن اقامتی،
          هیچگونه مسئولیتی متوجه مجموعه فلای تودی نمی باشد. ضمن اطلاع از قوانین و مقررات مربوطه
          تایید و اقرار می نمایم که شماره تلفن اعلامی متعلق به شخص بنده و در اختیار اینجانب بوده و
          کلیه پیامک های اطلاع رسانی اعم از زمان پرواز، تغییرات زمانی، قیمتی، اعلام تخفیفات و هرگونه
          اطلاع رسانی دیگراز طریق این شماره در حکم اعلام به اینجانب بوده و تعهد و اقرار می نمایم که
          سرشماره پیامکی را مسدود ننمایم و در صورت مسدودی سرشماره کلیه عواقب و مسئولیتهای متعلقه را
          می پذیرم و حق هرگونه ادعا و دعوایی علیه فلای تودی را از خود سلب و ساقط می نمایم. چنانچه از
          طرف شرکت وجهی به صورت اشتباه به حساب مشتری اعم از مدیران آن در اشخاص حقوقی و یا حساب شرکت
          و یا هر شخص مرتبط واریز گردد؛ مشتری و در صورتی که شخص حقوقی باشد، شخصیت حقوقی وی و مدیران
          صاحب امضای مجاز آن موظفند پس از اعلام شرکت حداکثر ظرف 24 ساعت نسبت به استرداد وجوه به حساب
          شرکت آبنوس گشت تهران اقدام نمایند در غیر این صورت شرکت آبنوس گشت تهران این اختیار را دارد
          تا از محل مطالبات و یا سایر حسابهای مربوطه یا مدیران آن نزد شرکت برداشت نماید و یا راسا
          نسبت به ابطال خدمات خریداری شده که برای آن شرکت یا اشخاص صادر کرده است بدون اخطار قبلی
          باطل و وجوه حاصل از آن را با مبالغ واریزی اشتباه تهاتر نماید و نماینده حق هیچ‌گونه اعتراضی
          را در این خصوص ندارد. چنانچه شرکت تشخیص دهد که خرید یا خریدهایی توسط مشتری بدون پرداخت
          کامل وجه و یا هرگونه سواستفاده از مشکلات نرم افزاری و .... انجام شده است به تشخیص خود می
          تواند بلافاصله و بدون نیاز به اخطار قبلی و بدون نیاز به مراجعه به مراجع قضایی نسبت به
          ابطال خدمات خریداری شده اقدام نماید و نماینده حق هرگونه ادعا ویا اعتراضی را در این خصوص از
          خود سلب و ساقط نمود.
        </Text>
        <Divider my={6} />
        <Text textAlign="right">قوانین کنسلی رزرو هتل و بلیط</Text>
        <Text textAlign="right">
          برای مشاهده بلیط و واچر هتل باید رسید پرداختی توسط بانک تایید شود، در غیر این صورت رزرو
          پرواز یا هتل مورد نظر در حساب کاربری انجام نخواهد شد. هنگام بروز مشکلات سیستمی، دلایل
          امنیتی، هم‌زمانی رزرو با افراد دیگر و اشتباهات کارگزار و کارمند رزرواسیون، کلیه رزروهای
          نهایی شده کنسل خواهند شد و مبلغ رزرو برای مسافر برگردانده خواهد شد. در صورتی که هنگام
          پرداخت هزینه، از سامانه‌های پرداخت و رزرواسیون هتل‌ها مشکلی برای صدور بلیط، بیمه مسافرتی و
          واچر هتل پیش بیاید، فلای تودی هیچگونه مسئولیتی نخواهد داشت. البته، اگر مبلغی از حساب کاربر
          کسر شده باشد، شرکت فلای تودی موظف به بازپرداخت وجه خواهد بود. اگر ویزای مسافر صادر نشده
          باشد یا تایید آن بدون پاسخ مانده باشد، بلیط کنسل خواهد شد و بازپرداختی از سمت شرکت صورت
          نخواهد گرفت. پس از صدور بلیت، خرید شما قطعی شده و در منوی پیگیری خرید (در قسمت پروفایل
          کاربری) امکان پرینت بلیط الکترونیکی وجود دارد. همچنین شماره سریال بلیط برای مسافر ایمیل
          خواهد شد.
        </Text>
        <Divider my={6} />
        <Text textAlign="right">قوانین و مقررات رزرو و خرید بلیط هواپیما</Text>
        <Text textAlign="right">
          خرید بلیط از طریق وب سایت فلای تودی، قوانین و مقررات تجارت الکترونیک را شامل می‌شود و
          هرگونه تخلف پیگرد قانونی دارد. همچنین خریدار پس از خرید اینترنتی باید از کلیه قوانین و
          مقررات خرید بلیط آگاهی کامل داشته باشد. مسئولیت کنسلی،‌ تاخیر یا تعجیل در زمان پرواز طبق
          قوانین و مقررات سازمان هواپیمایی، برعهده‌ی شرکت هواپیمایی موردنظر خواهد بود و فلای تودی
          مسئولیتی در این مورد نخواهد داشت. مسافران هنگام ثبت نام و رزرو بلیط باید اطلاعات اصلی
          مانند نام و نام خانوادگی،‌ مسیر پرواز، ساعت پرواز، تاریخ سفر را به صورت صحیح وارد کنند.
          درغیر این صورت امکان اصلاح اطلاعات پس از خرید بلیط وجود نخواهد داشت و مسافر باید برای
          اصلاح اطلاعات، بلیط را کنسل و مجددا خریداری کند. تغییرات پرواز و نهایی شدن سفارش‌ها از
          طریق پیام کوتاه (اس ام اس) و ایمیل به مسافر اعلام می‌شود. به همین دلیل ورود شماره تلفن
          معتبر و ایمیل الزامی است و در غیر این صورت مسئولیت نرسیدن پیام‌ها به عهده مسافر خواهد بود.
          بلیط خریداری شده تنها متعلق به مسافری است که مشخصات آن در سیستم وارد شده و قابل انتقال به
          دیگر نیست. مسافران توجه داشته داشته باشند در صورت عدم مطابقت اطلاعات شخصی مسافر با کارت
          شناسایی و بلیط، پذیرش مسافر در فرودگاه انجام نخواهد شد. طبق قوانین هواپیمایی کشور، بازه
          سنی نوزاد بین 10 روز تا 2 سال و کودک بین 2 تا دوازده سال است و افراد بالای 12 سال نیز
          بزرگسال به حساب می‌آید. خریدار بلیط باید با توجه قوانین، اقدام به خرید بلیط کند. در صورت
          اشتباه وارد کردن رده سنی و تاریخ تولد، مسافر امکان سوار شدن به هواپیما را نخواهد داشت.
          قیمت بلیط هواپیما مسافران نوزاد، کودک و بزرگسال در بلیط های سیستمی ( بلیط‌هایی که تابع
          قوانین هواپیمایی کشوری است و نرخ آنها به صورت شناور به فروش می‌رسد) متفاوت خواهد بود،‌ اما
          در بلیط‌های چارتری ( بلیط‌هایی که نرخ آنها توسط آژانس چارتر کننده تعیین می‌شود و استرداد
          آن تابع قوانین سازمان هواپیمایی کشور نیست)، قیمت بلیط کودک با بزرگسال تفاوتی ندارد. امکان
          صدور بلیط برای کودک به تنهایی وجود ندارد و اگر رده سنی مسافر در سیستم، نوزاد ثبت شود برای
          او صندلی جداگانه درنظر گرفته نخواهد شد. اگر فرایند پرداخت وجه با موفقیت انجام شد و بلیط در
          حساب کاربری نمایش داده نشد، با همکاران پشتیبانی تماس گرفته شود. اگر مسافر اقدام به رزرو یا
          خرید بلیط از شرکت‌های مسافرتی دیگر کرده باشد و از وب سایت فلای تودی هم بلیط رزرو کند،‌ در
          صورت تکراری بودن رزرو، هیچ مسئولیتی برعهده وب سایت نخواهد بود و لغو رزرو یا بلیط از سمت
          ایرلاین انجام می‌شود و مسئولیت آن به عهده شخص مسافر است. اطلاعات درج شده در سایت، اعم از
          عوارض و مالیات، حق سرویس، صندلی پروازی، کترینگ پذیرایی و كلیه امكانات و توضیحاتی كه نمایش
          داده می‌شود، مستقیم از سیستم ایرلاین مربوطه دریافت و بر روی سایت نمایش داده شده است، به
          همین دلیل كلیه مسئولیت‌های مربوط به اطلاعات بر عهده ایرلاین خواهد بود. حضور مسافر در
          فرودگاه برای پروازهای داخلی 2 ساعت قبل از پرواز و برای پروازهای خارجی 4 ساعت قبل از پرواز
          الزامی است. در صورتی که مشتری اقدام به رزرو بلیط کند ولی درخواست صدور بلیط را در سایت ثبت
          نکند بعد از پایان محدوده زمان صدور بلیط، رزرو باطل می‌شود و مجددا باید برای رزرو و صدور
          بلیط با قیمت جدید اقدام کنند. هنگام مراجعه به فرودگاه باید پرینت بلیط یا شماره سریال بلیط
          همراه مسافر باشد. همچنین همراه داشتن مدارک احراز هویت از جمله کارت ملی، گذرنامه (در پرواز
          های خارجی) و روادید (در صورت نیاز) جهت صدور کارت پرواز الزامی است. همراه داشتن مجوز پزشکی
          جهت پذیرش خانم‌های باردار، افراد مبتلا به بیماری‌های قلبی-عروقی، بیماری‌های تنفسی، صرع،
          آنمی شدید، دیابت ملیتوس کنترل نشده، کسانی که دیالیز می‌شوند یا کسانی که از داروهای تضعیف
          کننده سیستم ایمنی استفاده می‌کنند و هرگونه بیماری که سبب منع سفر هوایی باشد، ارائه آن
          هنگام سوارشدن به هواپیما ضروری است. برای تقاضای خدمات خاص (ولیچر، ماسک اکسیژن و بالابر)
          برای مسافرینی که شرایط عمومی متفاوتی دارند، باید با هماهنگی آژانس انجام شود. در صورتی که
          مسافر تمایل به خرید بلیط دو پرواز متوالی داشته باشد، باید حداقل ۳ ساعت بین رسیدن پرواز اول
          به مقصد و حرکت پرواز دوم فاصله باشد. در غیر این صورت مسئولیت جاماندن مسافر از پرواز دوم به
          عهده مسافر خواهد بود. کلیه نرخ‌گذاری بلیت پرواز داخلی توسط شرکت‌های هواپیمایی اعلام میگردد
          و این شرکت هیچگونه دخل و تصرفی در این نرخ‌ها نخواهد داشت. قوانین چارتر تغییرات در پروازهای
          چارتری بیشتر از پروازهای سیستمی است و یک درصد امکان دارد که بلیط خریداری شده قابل استفاده
          نباشد. در صورت خرید بلیط جایگزین، هزینه بلیط از طرف چارتر کننده برگردانده خواهد شد. در
          صورتی که پرواز چارتر کنسل شود و بلیط جایگزین از طرف آژانس دریافت نشود، مبلغ بلیط به طور
          کامل برگردانده خواهد شد. قیمت بلیط چارتر برای کودکان بین 2 تا 12 سال با قیمت بلیط بزرگسال
          تفاوتی نمی‌کند.
        </Text>
      </View>
    </BackLayout>
  );
};
